In [ ]:
#import libraries n load
import pandas as pd

A = pd.read_excel('MessyData.xlsx', sheet_name='Messy data')
A

     Emp_ID       Name   Age  Gender     Dept Joining_Date  Salary       City
0      1001       Neha  59.0       F       hr   10/05/2019  33,389      delhi
1      1002     Vikram  49.0    Male    SALES   07-14-2016  54,826      delhi
2      1003      Meera   NaN       M       hr   2021-10-05     36k  Bangalore
3      1004  Raj Kumar  28.0  Female    Sales   11/07/2017   76163      Delhi
4      1005      Sahil  41.0    Male    SALES   02-15-2017   41653      Delhi
..      ...        ...   ...     ...      ...          ...     ...        ...
495    1496       Aman   NaN       F       IT   2018-01-08   85661     Mumbai
496    1497      Divya   NaN     NaN  Finance   03-27-2017     38k      Delhi
497    1498      Sahil   NaN  Female      NaN   06/09/2020     NaN     Mumbai
498    1499      Rohan   NaN  Female       IT   09/07/2015     74k       Pune
499    1500  Raj Kumar   NaN     NaN       HR   12-08-2016     50k      delhi

[500 rows x 8 columns]

In [ ]:
#overview of dataframe
A.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Emp_ID        500 non-null    int64
 1   Name          500 non-null    object
 2   Age           163 non-null    float64
 3   Gender        337 non-null    object
 4   Dept          447 non-null    object
 5   Joining_Date  500 non-null    object
 6   Salary        367 non-null    object
 7   City          453 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 31.4+ KB

In [ ]:
#summary of statistics
A.describe()

            Emp_ID         Age
count   500.000000  163.000000
mean   1250.500000   42.288344
std     144.481833   11.492200
min    1001.000000   21.000000
25%    1125.750000   32.500000
50%    1250.500000   44.000000
75%    1375.250000   53.000000
max    1500.000000   59.000000

In [ ]:
#checking missing values
A.isnull()

     Emp_ID   Name    Age  Gender   Dept  Joining_Date  Salary   City
0     False  False  False   False  False         False   False  False
1     False  False  False   False  False         False   False  False
2     False  False   True   False  False         False   False  False
3     False  False  False   False  False         False   False  False
4     False  False  False   False  False         False   False  False
..      ...    ...    ...     ...    ...           ...     ...    ...
495   False  False   True   False  False         False   False  False
496   False  False   True    True  False         False   False  False
497   False  False   True   False   True         False    True  False
498   False  False   True   False  False         False   False  False
499   False  False   True    True  False         False   False  False

[500 rows x 8 columns]

In [ ]:
#sum of missing values
A.isnull().sum()

Emp_ID            0
Name              0
Age             337
Gender          163
Dept             53
Joining_Date      0
Salary          133
City             47
dtype: int64

In [ ]:
#shows duplicate values
A.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
495    False
496    False
497    False
498    False
499    False
Length: 500, dtype: bool

In [71]:
# Convert gender to consistent format
A['Gender'] = A['Gender'].replace({'M':'Male', 'F':'Female'})
A['Gender'] = A['Gender'].fillna('Unknown')

In [ ]:
# Convert all department to lowercase, then title case
A['Dept'] = A['Dept'].str.lower().str.title()
A['Dept'] = A['Dept'].fillna('Unknown')

In [ ]:
#standarize salary
# 1) Make everything a string
A['Salary'] = A['Salary'].astype(str)

# 2) Remove commas
A['Salary'] = A['Salary'].str.replace(',', '')

# 3) Handle "36k" type values
A['Salary'] = A['Salary'].str.replace('k', '000', case=False)

# 4) Convert to numeric
A['Salary'] = pd.to_numeric(A['Salary'], errors='coerce')

# 5) Fill missing with median
A['Salary'] =A['Salary'].fillna(A['Salary'].median())

A['Salary'] = A['Salary'].apply(lambda x: f"{int(x):,}")

In [ ]:
#standarize joining date
#  Convert to string and remove spaces
A['Joining_Date'] = A['Joining_Date'].astype(str).str.strip()

#  Replace empty or bad cells with 'Unknown'
A['Joining_Date'] = A['Joining_Date'].replace(['', 'nan', 'NaT', 'None'], 'Unknown')

#  Format readable dates; keep 'Unknown' as it is
A['Joining_Date'] = A['Joining_Date'].apply(
    lambda x: pd.to_datetime(x, errors='coerce').strftime('%d %b %Y') if x != 'Unknown' else 'Unknown'
)

C:\Users\Bhavna kumawat\AppData\Local\Temp\ipykernel_7816\762752437.py:16: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  lambda x: pd.to_datetime(x, errors='coerce').strftime('%d %b %Y') if x != 'Unknown' else 'Unknown'

In [74]:
# Fill missing ages with median
A['Age'] = A['Age'].fillna(A['Age'].median())

In [ ]:
# Fill missing city with unknown
A['City'] =A['City'].fillna('Unknown')

In [ ]:
#Viewing cleaned data
A.head()

   Emp_ID       Name   Age  Gender   Dept Joining_Date  Salary       City
0    1001       Neha  59.0  Female     Hr  05 Oct 2019  33,389      delhi
1    1002     Vikram  49.0    Male  Sales  14 Jul 2016  54,826      delhi
2    1003      Meera  44.0    Male     Hr  05 Oct 2021  36,000  Bangalore
3    1004  Raj Kumar  28.0  Female  Sales  07 Nov 2017  76,163      Delhi
4    1005      Sahil  41.0    Male  Sales  15 Feb 2017  41,653      Delhi

In [82]:
# Save cleaned file
A.to_excel('CleanedMessyData.xlsx', index=False)